// variable ตัวแปร
// เป็นชื่อที่ตั้งเอง ใช้เก็บข้อมูล
// การใช้งานตัวแปร คือ เอาค่าไปเก็บในตัวแปร หรือ เอาค่าในตัวแปรมาใช้
//------------------------------

// var 
// สามารถเปลี่ยนค่าได้ 
// ไม่ต้องมีค่าเริ่มต้นก็ได้ หรือไม่กำหนดค่าก็ได้
// เป็นต้วแปรแบบ golbal (ที่ไหรก็ได้) 

var aa = 10

// let
// สามารถเปลี่ยนค่าได้ 
// ไม่ต้องมีค่าเริ่มต้นก็ได้ หรือไม่กำหนดค่าก็ได้
// เป็นต้วแปรแบบ local (เฉพาะที่) ในบล็อก code หนึ่ง ๆ หรือในสโคป {} เดียวเท่านั้น
let bb = 20


// const
// ไม่่สามารถเปลี่ยนค่าได้
// ต้องมีค่าเริ่มต้นหรือต้องกำหนดค่าเสมอ 
// เป็นต้วแปรแบบ local (เฉพาะที่) ในบล็อก code หนึ่ง ๆ หรือในสโคป {} เดียวเท่านั้น
const cc = 30